class RuMessages():
    reg1 = '✨ Добро пожаловать в портал <b>не</b> кошелька'
    reg2 = '⚡️ Готовим кошелек для вас, <b>пожалуйста, подождите..</b>'
    reg3 = '👁 <b>Телепортируем</b> в меню...'
    welcome_message = '''
Привет, я бот - кошелек. 

Ты можешь познакомится с моим функционалом в разделе <b>Помощь</b>
Жми на кнопки ниже, чтобы взаимодействовать со мной!'''


    settings_message = """
Это настройик, тут ты можешь выбрать язык, изменить свои параметры или связаться с поддержкой.
Используй эти функции ответственно!"""

class CnMessages():
    reg1 = '✨ 欢迎来到门户网站，而不是钱包'
    reg2 = '⚡️  我们正在为您准备钱包，请稍候...'
    reg3 = '👁 传送到菜单...'
    welcome_message = """
你好，我是机器人钱包。

你可以在<b>帮助</b>部分了解我的功能。
点击下方按钮与我互动！"""

    settings_message = """
在此设置中，您可以<b>选择语言</b>、<b>更改设置</b>或<b>联系客服</b>。
请负责任地使用这些功能！"""

class EnMessages():
    reg1 = '✨ Welcome to the portal called <b>not</b>AWallet..'
    reg2 = '⚡️ Prepairing a wallet for you, <b>please, wait a bit</b>...'
    reg3 = '👁 <b>Teleporting</b> to menu...'
    welcome_message = """
Hi, I'm a bot - wallet.

You can get acquainted with my functionality in the <b>Help</b> section
Click on the buttons below to interact with me!"""

    settings_message = """
This is a setting where you can <b>select a language</b>, <b>change your settings</b>, or <b>contact support</b>.
Use these features responsibly!"""